export const Instructions = {
    "Регистрация и авторизация": {
        icon: '/svg/tools_settings.svg',
        instructions: [
            {title: "Создание аккаунта", text: "Перейдите на страницу регистрации и введите свой email. Вы также можете использовать учетные данные Facebook или Google для быстрой регистрации. После подтверждения email ваш аккаунт будет готов к использованию."},
            {title: "Вход в систему", text: "Введите свой email и пароль на странице входа. Если вы используете социальные сети для входа, выберите соответствующую иконку. После входа вы получите доступ к созданию и редактированию древ."},
            {title: "Восстановление пароля", text: "Если вы забыли пароль, перейдите по ссылке 'Забыли пароль?' на странице входа. Введите свой email, и мы отправим вам инструкции по восстановлению пароля."}
        ]
    },
    "Создание древа": {
        icon: '/svg/tools_plum_tree.svg',
        instructions: [
            {title: "Начало работы", text: "На главной странице выберите 'Создать новое древо'. Выберите шаблон древа и начните добавлять персонажей из The Sims 4, используя опцию 'Добавить члена семьи'. Вы можете добавлять информацию, фотографии и даже истории к каждому профилю."},
            {title: "Редактирование древа", text: "Чтобы редактировать информацию о членах семьи, просто кликните на их профиль в древе. Вы можете изменять имена, даты рождения, фотографии и прочую информацию. Также возможно добавлять, удалять или перестраивать отношения между персонажами."}
        ]
    },
    "Выгрузка и загрузка": {
        icon: '/svg/tools_download.svg',
        instructions: [
            {title: "Экспорт древа", text: "В вашем профиле найдите раздел 'Мои древья' и выберите древо, которое хотите экспортировать. Нажмите 'Экспорт' и выберите формат файла. Вы можете сохранить древо как изображение или PDF файл для печати или использования вне сайта."},
            {title: "Импорт данных", text: "Для импорта информации о семье, перейдите в раздел 'Мои древья' и выберите 'Импорт'. Вы можете загрузить файлы в формате GEDCOM или другие поддерживаемые форматы. После загрузки данные автоматически интегрируются в ваше древо."}
        ]
    },
    "Общение и коммьюнити": {
        icon: '/svg/tools_chat.svg',
        instructions: [
            {title: "Обсуждение и советы", text: "Присоединяйтесь к форумам и группам внутри сообщества, чтобы делиться советами и идеями. Задавайте вопросы, участвуйте в обсуждениях и делитесь своими успехами в создании древ."},
            {title: "Совместные проекты", text: "Для участия в совместных проектах перейдите в раздел 'Совместные древья'. Вы можете присоединиться к существующему проекту или создать свой. Приглашайте других пользователей для совместной работы над древом, обменивайтесь идеями и информацией."}
        ]
    },
    "FAQ": {
        icon: '/svg/tools_faq.svg',
        instructions: [
            {title: "Частые вопросы", text: "Если у вас возникли вопросы, посетите раздел FAQ. Здесь вы найдете ответы на распространенные вопросы относительно регистрации, создания и редактирования древ, а также информацию о функциях сайта."},
            {title: "Решение проблем", text: "Если вы столкнулись с техническими проблемами или ошибками на сайте, ознакомьтесь с нашим разделом по решению проблем. Если вы не нашли ответа, свяжитесь с нашей службой поддержки через форму обратной связи."}
        ]
    }
};