export const Instructions = {
    "Регистрация и авторизация": {
        icon: '/svg/tools_settings_green.svg',
        instructions: [
            {title: "Создание аккаунта", text: "Перейдите на страницу регистрации, нажав на кнопку «Вход/регистрация». Далее введите свои данные: логин, E-mail, пароль. Вы также можете использовать учетную запись Google для быстрой регистрации. После подтверждения E-mail ваш аккаунт будет готов к использованию."},
            {title: "Вход в систему", text: "Перейдите на страницу входа в аккаунт, нажав на кнопку «Вход/регистрация». Введите свои данные, указанные при регистрации: логин/E-mail и пароль. Если вы используете учетную запись Google для входа, то выберите соответствующую иконку. После входа вы получите доступ к созданию и редактированию древ."},
            {title: "Восстановление пароля", text: "Если вы забыли пароль, перейдите на страницу входа в аккаунт, нажав кнопку «Вход/регистрация». Далее выберете «Забыли пароль?». Введите свой Е-mail, и мы отправим вам инструкции по восстановлению пароля."}
        ]
    },
    "Создание древа": {
        icon: '/svg/tools_plum_tree_green.svg',
        instructions: [
            {title: "Начало работы", text: "инструкции находятся в разработке"},
            {title: "Редактирование древа", text: "инструкции находятся в разработке"}
        ]
    },
    "Выгрузка и загрузка": {
        icon: '/svg/tools_download_green.svg',
        instructions: [
            {title: "Экспорт древа", text: "инструкции находятся в разработке"},
            {title: "Импорт данных", text: "инструкции находятся в разработке"}
        ]
    },
    "Общение и коммьюнити": {
        icon: '/svg/tools_chat_green.svg',
        instructions: [
            {title: "Обсуждение и советы", text: "Присоединяйтесь к нашему телеграм-каналу (https://t.me/dynastytree) чтобы делиться советами и идеями с другими игроками, задавать вопросы создателям сайта, а также участвовать в обсуждениях и рассказать о своих успехах в создании древ."},
            {title: "Совместные проекты", text: "Если у вас появилось к нам какое-то предложение для сотрудничества, то напишите нам info@simsdynastytree.com"}
        ]
    },
    "FAQ": {
        icon: '/svg/tools_faq_green.svg',
        instructions: [
            {title: "Частые вопросы", text: "инструкции находятся в разработке"},
            {title: "Решение проблем", text: "инструкции находятся в разработке"}
        ]
    }
};